// 正则匹配
export const REGEX = {
  // 用户名
  USERNAME: /^([0-9a-zA-Z]|[\u0391-\uFFE5]){2,}$/,
  // 中文
  ONLY_CHINESE: /^[\u4E00-\u9FA5]+$/,
  // 中英文
  CHINESE_AND_ENGLISH: /^[\u4E00-\u9FA5a-zA-Z]+$/,
  // 手机
  MOBILE: /^[1][3-8]\d{9}$/,
  // MOBILE: /^(13[0-9]|14[57]|15[01-37-9]|18[0235-9])\d{8}$/,
  // 身份证
  ID_CARD: /(^\d{15}$)|(^\d{18}$)|(^\d{17}(\d|X|x)$)/,
  // 英语和数字
  ENGLISH_AND_NUMBER: /^[a-zA-Z0-9]+$/,
  // 特殊字符
  SPECIAL_CHARACTER: /([^0-9a-zA-Z\u4E00-\u9FA5])+/,
  // 数字且最多只能有两位小数
  FLOAT2ING: /^\d+(\.\d{0,2})?$/,
  // 邮件地址
  EMAIL: /^[\w!#$%&\'*+\/=?^_`{|}~-]+(?:\.[\w!#$%&\'*+\/=?^_`{|}~-]+)*@(?:[\w](?:[\w-]*[\w])?\.)+[\w](?:[\w-]*[\w])?$/,
  // 非数字
  NO_NUMBER: /[\D|\.]/,
  // 大于0的数字,可以为小数点
  Number_point: /^([1-9]\d*(\.\d*[1-9])?)|(0\.\d*[1-9])$/,
  // 大于0的数保留两位小数点
  big_zore: /^\d+(\.\d{1,2})?$/,
  // 纯数字
  ONLY_NUMBER: /^[0-9]+$/,
  // 纯字母
  ONLY_LETTER: /^[a-zA-Z]+$/,
  // 纯符号 !$^&*()+{}|:?-=[]./ 此种情况下这19个是特殊字符
  ONLY_PUNCTUATION: /^[~\!@#\$%\^\&\*\(\)_\+\{\}\|\:\"<>\?`\-\=\[\]\\;\',\.\/]+$/,
  // 大于0的数字
  Number_big: /^([1-9]\d+|0)(\.[0-9]\d+)*$/,
  // 字母和数字
  ONLY_NUMBER_AND_LETTER: /^[0-9a-zA-Z]+$/,
  NUM_AND_LETTER:/^(?![0-9]+$)(?![a-zA-Z]+$)[0-9A-Za-z]{6,20}$/,

  //  6-32位密码
  PWD_NUMBER_AND_LETTER: /^[0-9a-zA-Z_#]{6,32}$/,
  // 字母和符号
  ONLY_LETTER_AND_PUNCTUATION: /^[a-zA-Z~\!@#\$%\^\&\*\(\)_\+\{\}\|\:\"<>\?`\-\=\[\]\\;\',\.\/]+$/,
  // 数字和符号
  ONLY_NUMBER_AND_PUNCTUATION: /^[0-9~\!@#\$%\^\&\*\(\)_\+\{\}\|\:\"<>\?`\-\=\[\]\\;\',\.\/]+$/,
  // 同时包含字母数字和符号
  LETTER_AND_NUMBER_AND_PUNCTUATION: /^[a-zA-Z0-9~\!@#\$%\^\&\*\(\)_\+\{\}\|\:\"<>\?`\-\=\[\]\\;\',\.\/]+$/,
//       LETTER_AND_NUMBER_AND_PUNCTUATION : /(^[a-zA-Z]+$)&(^[0-9]+$)(^[~\!@#\$%\^\&\*\(\)_\+\{\}\|\:\"<>\?`\-\=\[\]\\;\',\.\/]+$)/,
  // 纯数字从1开始
  ONLY_NUMBER_GT: /^[1-9]\d*$/,
  // 限制输入10个字符
  ONLY_ZF: /^[\u4e00-\u9fffa-zA-Z]{1,10}$/,
  // 不可以为空格
  KONGE: /^[^ ]{6,16}$/,
  // 只含有英文字母、数字和下划线
  ONLY_ENGLISH_NUMBER: /^[A-Za-z0-9_]+$/,
  // 国内电话(区号-号码)
  TELEPHONE: /(^\d{3}-\d{8}$)|(^\d{4}-\d{7,8}$)/,
  // 电话号码和手机号码同时验证
  TELANDPHONE: /((\d{11})|^((\d{7,8})|(\d{4}|\d{3})-(\d{7,8})|(\d{4}|\d{3})-(\d{7,8})-(\d{4}|\d{3}|\d{2}|\d{1})|(\d{7,8})-(\d{4}|\d{3}|\d{2}|\d{1}))$)/,
  // 邮编
  ZIPCODE: /^[1-9]\d{5}(?!\d)$/,
  // 保留两位小数点
  NUM_POINT: /^(([1-9][0-9])|(([0].\d{0,2}|[1-9][0-9].\d{0,2})))$/,
  NUM_POINT2: /^0\.\d\d?$/,
  // 支持百分比
  NUM_PERCENTAGE: /^([1-9]{1}[0-9]{0,1}|0|100)(.\d{1,2}){0,1}%$/,

  ENGLISH_AND_NUMBER20:/^(?=.*[A-Za-z])(?=.*\d)[A-Za-z\d]{6,20}$/,
  /**
   * 获取字符长度
   */
  strlen: function(str) {
    var s = 0
    for (var i = 0; i < str.length; i++) {
      if (str.charAt(i).match(/[\u0391-\uFFE5]/)) {
        s += 2
      } else {
        s++
      }
    }
    return s
  }
}
